# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Kevin-Patxi\Documents\GitHub\3D-Immersion-Project\Project 1\Project 1.cydsn\Project 1.cyprj
# Date: Mon, 10 Feb 2014 02:53:51 GMT
#set_units -time ns
create_clock -name {ADC_Ext_CP_Clk(routed)} -period 479.16666666666663 -waveform {0 239.583333333333} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyXTAL} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/xtal}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {ADC_Ext_CP_Clk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 23 47} -nominal_period 479.16666666666663 [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {ADC_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 93 187} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_clock -name {ADC_theACLK(fixed-function)} -period 1937.5 -waveform {0 968.75} [get_pins {ClockBlock/aclk_glb_ff_0}]
create_generated_clock -name {PWM_Clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 481 961} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\Kevin-Patxi\Documents\GitHub\3D-Immersion-Project\Project 1\Project 1.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Kevin-Patxi\Documents\GitHub\3D-Immersion-Project\Project 1\Project 1.cydsn\Project 1.cyprj
# Date: Mon, 10 Feb 2014 02:53:44 GMT
